In [4]:
import pandas as pd

In [5]:
edata = [
    [100,'Thomas','Mgr',3200],
    [200,'Mary','Pgmr',4700],
    [300,'Kate','HR',2800],
    [400,'Jon','Mgr', 3000],
    [500,'Jim','Pgmr',7600],
    [600,'Harry','HR',4800]
]

In [10]:
e1 = pd.DataFrame(edata)
#e1

In [7]:
type(e1)

pandas.core.frame.DataFrame

In [11]:
e2 = pd.DataFrame(edata, columns=['eid','ename','job','sal'])
#e2

In [14]:
edf = pd.DataFrame(edata, 
                   columns=['eid','ename','job','sal'], 
                   index=['e1','e2','e3','e4','e5','e6']
                  )
edf

    eid   ename   job   sal
e1  100  Thomas   Mgr  3200
e2  200    Mary  Pgmr  4700
e3  300    Kate    HR  2800
e4  400     Jon   Mgr  3000
e5  500     Jim  Pgmr  7600
e6  600   Harry    HR  4800

#### Accessing Data

#### Single Row

In [26]:
edf.loc['e3',:]
### Exception
edf.loc['e3']

eid       300
ename    Kate
job        HR
sal      2800
Name: e3, dtype: object

In [25]:
edf.iloc[2,:]
### Exception
edf.iloc[2]

eid       300
ename    Kate
job        HR
sal      2800
Name: e3, dtype: object

#### Range of Rows

In [27]:
edf.loc['e3':'e5', :]
### Exception
edf.loc['e3':'e5']

    eid ename   job   sal
e3  300  Kate    HR  2800
e4  400   Jon   Mgr  3000
e5  500   Jim  Pgmr  7600

In [28]:
edf.iloc[2:5, :]
### Exception
#edf.iloc[2:5]

    eid ename   job   sal
e3  300  Kate    HR  2800
e4  400   Jon   Mgr  3000
e5  500   Jim  Pgmr  7600

#### Random Rows

In [30]:
edf.loc[['e2','e4'], :]
### Exception
edf.loc[['e2','e4']]

    eid ename   job   sal
e2  200  Mary  Pgmr  4700
e4  400   Jon   Mgr  3000

In [33]:
edf.iloc[[1,3],:]
### Exception
edf.iloc[[1,3]]

    eid ename   job   sal
e2  200  Mary  Pgmr  4700
e4  400   Jon   Mgr  3000